In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [3]:
s2=pd.Series([4,5,6])
s2

0    4
1    5
2    6
dtype: int64

In [4]:
pd.concat([s1,s2])

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

In [5]:
s2=pd.Series([4,5,6,8,2,3,1])
s2

0    4
1    5
2    6
3    8
4    2
5    3
6    1
dtype: int64

In [6]:
pd.concat([s1,s2])

0    1
1    2
2    3
0    4
1    5
2    6
3    8
4    2
5    3
6    1
dtype: int64

In [7]:
df1=pd.DataFrame({"ID":[1,2,3,4],"Name":["A","B","C","D"],"Class":[10,11,12,13]})
df1

   ID Name  Class
0   1    A     10
1   2    B     11
2   3    C     12
3   4    D     13

In [8]:
df2=pd.DataFrame({"ID":[5,6,7,8],"Name":["E","F","G","H"],"Class":[7,8,9,10]})
df2

   ID Name  Class
0   5    E      7
1   6    F      8
2   7    G      9
3   8    H     10

In [9]:
pd.concat([df1,df2])

   ID Name  Class
0   1    A     10
1   2    B     11
2   3    C     12
3   4    D     13
0   5    E      7
1   6    F      8
2   7    G      9
3   8    H     10

In [10]:
pd.concat([df2,df1])

   ID Name  Class
0   5    E      7
1   6    F      8
2   7    G      9
3   8    H     10
0   1    A     10
1   2    B     11
2   3    C     12
3   4    D     13

In [11]:
pd.concat([df1,df2],axis=1)

   ID Name  Class  ID Name  Class
0   1    A     10   5    E      7
1   2    B     11   6    F      8
2   3    C     12   7    G      9
3   4    D     13   8    H     10

In [12]:
pd.concat([df1,df2],axis=0,ignore_index=True)

   ID Name  Class
0   1    A     10
1   2    B     11
2   3    C     12
3   4    D     13
4   5    E      7
5   6    F      8
6   7    G      9
7   8    H     10